In [2]:
import numpy as np
import pandas as pd
np.set_printoptions(precision=2)

In [3]:
data = pd.read_csv('https://raw.githubusercontent.com/Yorko/mlcourse.ai/main/data/beauty.csv', sep=';')

In [4]:
data.shape

(1260, 10)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   wage      1260 non-null   float64
 1   exper     1260 non-null   int64
 2   union     1260 non-null   int64
 3   goodhlth  1260 non-null   int64
 4   black     1260 non-null   int64
 5   female    1260 non-null   int64
 6   married   1260 non-null   int64
 7   service   1260 non-null   int64
 8   educ      1260 non-null   int64
 9   looks     1260 non-null   int64
dtypes: float64(1), int64(9)
memory usage: 98.6 KB

In [6]:
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [7]:
data.iloc[0:5, 9:12]

   looks
0      4
1      3
2      4
3      3
4      3

In [8]:
data[data['female'] == 1]['wage'].mean(), \
data[data['female'] == 0]['wage'].mean()

(4.299357798165136, 7.3688228155339734)

In [9]:
data[(data['female'] == 0) & (data['married'] == 1)]['wage'].median(), \
data[(data['female'] == 0) & (data['married'] == 0)]['wage'].median()

(6.710000000000001, 5.0649999999999995)

In [10]:
data[(data['female'] == 1) & (data['black'] == 1)]['wage'].median(), \
data[(data['female'] == 1) & (data['black'] == 0)]['wage'].median()

(3.535, 3.75)

In [11]:
for look, sub_df in data.groupby('looks'):
    print(look)
    print(sub_df['female'].mean())

1
0.38461538461538464
2
0.38028169014084506
3
0.32271468144044324
4
0.37362637362637363
5
0.42105263157894735

In [12]:
data[['wage', 'exper']]#.agg(np.median)

       wage  exper
0      5.73     30
1      4.28     28
2      7.96     35
3     11.57     38
4     11.42     27
...     ...    ...
1255   1.61     25
1256   1.68      4
1257   3.29     35
1258   2.31     15
1259   1.92     24

[1260 rows x 2 columns]

In [13]:
data[['wage', 'exper']].agg(np.median)

wage      5.3
exper    15.0
dtype: float64

In [14]:
data.groupby('looks')[['wage', 'exper']].median()

        wage  exper
looks
1      3.460   32.0
2      4.595   18.0
3      5.635   18.0
4      5.240   12.5
5      4.810    8.0

In [15]:
data.groupby('looks')[['wage', 'exper']].agg(np.median)

        wage  exper
looks
1      3.460   32.0
2      4.595   18.0
3      5.635   18.0
4      5.240   12.5
5      4.810    8.0

In [16]:
pd.crosstab(data['female'], data['married'])

married    0    1
female
0        166  658
1        223  213

In [17]:
data['wage']

0        5.73
1        4.28
2        7.96
3       11.57
4       11.42
        ...
1255     1.61
1256     1.68
1257     3.29
1258     2.31
1259     1.92
Name: wage, Length: 1260, dtype: float64

In [18]:
data['is_rich'] = (data['wage'] > data['wage'].quantile(.75)).astype('int')

In [19]:
data.head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich
0,5.73,30,0,1,0,1,1,1,14,4,0
1,4.28,28,0,1,0,1,1,0,12,3,0
2,7.96,35,0,1,0,1,0,0,10,4,1
3,11.57,38,0,1,0,0,1,1,16,3,1
4,11.42,27,0,1,0,0,1,0,16,3,1

In [20]:
data['female'].apply(lambda female: 'female' if female else 'male')

0       female
1       female
2       female
3         male
4         male
         ...
1255    female
1256    female
1257    female
1258    female
1259    female
Name: female, Length: 1260, dtype: object

In [21]:
dic = {1: 'union', 0: 'non-union'}
data['union'].map(dic).head(5)

0    non-union
1    non-union
2    non-union
3    non-union
4    non-union
Name: union, dtype: object